# YOLOv10s + TAL-FFN (Task-driven Asymmetric Lightweight Feature Fusion Network)
# Stage 5: 完整版 TAL-FFN
# 集成所有组件:
#   - ADSA (Asymmetric Depth Strategy Allocation)
#   - CADFM (Context-Aware Dynamic Fusion Mechanism)
#   - DSConv (Depthwise Separable Convolution)
#   - SimAM (Simple Attention Module)
#   - MPDIoU (Minimum Point Distance IoU)
nc: 27
scales:
  s: [0.33, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat P4
  - [-1, 3, C2f, [512]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat P3
  - [-1, 3, C2f, [256]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 2], 1, Concat, [1]] # 18 cat P2
  - [-1, 3, C2f, [128]] # 19 (P2 head)

  # TAL-FFN Module: ADSA + CADFM + DSConv
  # 配置:
  #   - heavy_levels=2, heavy_repeats=2, light_repeats=1 (ADSA)
  #   - use_cawn=true, reduction=4 (CADFM)
  #   - 所有卷积使用DSConv替代标准卷积
  # Inputs: P2(19), P3(16), P4(13), P5(10)
  - [[19, 16, 13, 10], 1, TALFFN, [128, 2, 2, 1, true, true, true]] # 20: [P2, P3, P4, P5]
  # 参数说明:
  # 128: out_channels
  # 2: heavy_levels (P2/P3使用heavy_repeats)
  # 2: heavy_repeats (P2/P3使用2个DSConv块)
  # 1: light_repeats (P4/P5使用1个DSConv块)
  # true: use_cawn (启用CAWN动态权重)
  # true: use_adsa (启用ADSA非对称深度分配)
  # true: use_dsconv (使用DSConv替代标准卷积)

  - [20, 1, FeatureSelect, [0]] # 21 P2
  - [-1, 1, SimAM, []] # 22 添加SimAM注意力

  - [20, 1, FeatureSelect, [1]] # 23 P3
  - [-1, 1, SimAM, []] # 24 添加SimAM注意力

  - [20, 1, FeatureSelect, [2]] # 25 P4
  - [-1, 1, SimAM, []] # 26 添加SimAM注意力

  - [20, 1, FeatureSelect, [3]] # 27 P5
  - [-1, 1, SimAM, []] # 28 添加SimAM注意力

  - [[22, 24, 26, 28], 1, v10Detect, [nc]] # Detect(P2, P3, P4, P5)